uat_chat/InformationRegisters/ДатыОбновления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ДатыОбновления</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>идИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

uat_chat/InformationRegisters/ДатыОбновления/Ext/ManagerModule.bsl
Функция идИзменения(имяОбк) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДатыОбновления.идИзменения
	               |ИЗ
	               |	РегистрСведений.ДатыОбновления КАК ДатыОбновления
	               |ГДЕ
	               |	ДатыОбновления.ВидСпр = &ВидСпр";
	Запрос.УстановитьПараметр("ВидСпр",имяОбк);
	
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() ТОгда
		Возврат Выб.идИзменения;
	КонецеСЛИ;
	
	Возврат "none";
	
КонецФункции

Процедура ЗаписатьИдИзменения(имяОбъекта,идИзменения) Экспорт
	
	Зап = РегистрыСведений.ДатыОбновления.СоздатьМенеджерЗаписи();
	Зап.ВидСпр = имяОбъекта;
	Зап.Дт = ТекущаяДата();
	Зап.идИзменения = идИзменения;
	Зап.Записать();
	
КонецПроцедуры
